In [1]:
import data.cache
from data.cache import get_sonde_summaries_as_dataframe
all = get_sonde_summaries_as_dataframe()
all = all[['serial', 'frame', 'datetime', 'lat', 'lon']].reset_index(drop=True)

In [2]:
landings = all.loc[all.groupby('serial')['frame'].idxmax().unique()]

In [3]:
near = landings.loc[(landings.lat >= 37) & (landings.lat <= 42)]
near = near.loc[(near.lon >= -114) & (near.lon < -109)]

In [12]:

import math
import pandas as pd
allpairs = []
for i in range(len(near)):
   a = near.iloc[i]
   for j in range(i+1, len(near)):
       b = near.iloc[j]
       dist = math.sqrt((a.lat - b.lat)**2 + (a.lon - b.lon)**2)
       if dist < .1:
           allpairs.append({'a': a.serial, 'b': b.serial, 'dist': dist})

In [13]:
len(allpairs)

15152

In [16]:
df2 = pd.DataFrame(allpairs).sort_values('dist')

In [17]:
df2

              a         b      dist
9665   22041331  T3420835  0.000041
2525   21007588  22054367  0.000422
14424   7345496  T3420835  0.000492
9663   22041331   7345496  0.000530
2800   21010136  23019403  0.000708
...         ...       ...       ...
529    20042028  22053861  0.099987
2231   20062070  22053893  0.099989
14016  23026449  23026636  0.099993
5890   22003835  22013013  0.099995
8270   22021144  23041173  0.099995

[15152 rows x 3 columns]

In [20]:
all.loc[all['serial'] == '22041331'].sort_values('frame')

          serial       frame                  datetime       lat        lon
652260  22041331  1354015511 2022-12-02 11:25:11+00:00  40.86214 -115.54653
671505  22041331  1354015511 2022-12-02 11:25:11+00:00  40.86214 -115.54653
652261  22041331  1354020700 2022-12-02 12:51:40+00:00  41.01421 -113.82579
671506  22041331  1354020700 2022-12-02 12:51:40+00:00  41.01421 -113.82579
652262  22041331  1354645784 2022-12-09 18:29:44+00:00  41.09435 -111.92789
671507  22041331  1354645784 2022-12-09 18:29:44+00:00  41.09435 -111.92789

In [21]:
all.loc[all['serial'] == 'T3420835'].sort_values('frame')

           serial  frame                         datetime       lat        lon
1580745  T3420835   1716 2023-06-13 16:08:31.999000+00:00  41.05725 -112.93506
1599363  T3420835   1716 2023-06-13 16:08:31.999000+00:00  41.05725 -112.93506
1580746  T3420835   6342        2023-06-13 17:25:38+00:00  40.91497 -112.98512
1599364  T3420835   6342        2023-06-13 17:25:38+00:00  40.91497 -112.98512
1580747  T3420835  30219 2023-06-14 00:03:35.001000+00:00  41.09439 -111.92790
1599365  T3420835  30219 2023-06-14 00:03:35.001000+00:00  41.09439 -111.92790

In [25]:
print(df2.head(20))

       a        b     dist
22041331 T3420835 0.000041
21007588 22054367 0.000422
 7345496 T3420835 0.000492
22041331  7345496 0.000530
21010136 23019403 0.000708
22031308 22055845 0.001000
21045789 23010133 0.001232
22040916 22041704 0.001571
22042862 U1520138 0.001748
22055787 23034200 0.002013
23013143 23013491 0.002140
22040998 23019032 0.002293
22019394 22054537 0.002429
22031228 22051959 0.002577
22044738 23009810 0.002591
23020394 23026678 0.002616
23020417 59903432 0.003082
22020712 22044780 0.003148
T3340552 U1510758 0.003505
21011626 22020162 0.003549

In [5]:
import numpy
numpy.sqrt([2, 3, 5])

array([1.41421356, 1.73205081, 2.23606798])

In [16]:
import pandas as pd
pd.concat([pd.Series([99]), pd.Series([1,2,3,4])], axis=1)

      0  1
0  99.0  1
1   NaN  2
2   NaN  3
3   NaN  4